# Chapter 7

## Data Cleaning and Preparation
Covers tools for missing data, duplicate data, string manipulation, and some other analytical data transformations

In [1]:
import numpy as np
import pandas as pd

In [2]:
examples = '../pydata-book-2nd-edition/examples/'
datasets = '../pydata-book-2nd-edition/datasets/'
## how to use df = pd.read_csv(examples+'ex1.csv')

### 7.1 Handling Missing Data
NaN is a sentinel value that can easily be detected<br/>
.isnull, other functions related to missing data are dropna, fillna, notnull

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None # Python None is also treated as NA in object arrays

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### Filtering Out Missing Data

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

This is equivalent to:

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna() # dropna by default drops and row containing missing data

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how='all') # will only drop rows what are all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all') # To drop columns in the same way, pass axis=1

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

thresh can be used when you want to keep only rows containing a certain number of observations

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df.iloc[:4, 1] = NA # assign rows less than 4 in column 1 to NA

In [22]:
df.iloc[:2, 2] = NA # assign rows less nhat 2 in column 2 to NA

In [23]:
df

          0        1         2
0  0.530240      NaN       NaN
1 -0.325325      NaN       NaN
2  0.636606      NaN  0.709533
3 -1.020924      NaN -1.777677
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

In [24]:
df.dropna()

          0        1         2
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

In [25]:
df.dropna(thresh=2) # defailt works on rows, droping rows with not at lease 2 non-NA values

          0        1         2
2  0.636606      NaN  0.709533
3 -1.020924      NaN -1.777677
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

In [26]:
df.dropna(thresh=4, axis=1) # drops col 1 as is does not have at least 4 non-NA values

          0         2
0  0.530240       NaN
1 -0.325325       NaN
2  0.636606  0.709533
3 -1.020924 -1.777677
4  0.204848 -0.059858
5  1.460365  1.599131
6  0.695110 -0.097918

#### Filling In Missing Data

In [27]:
df

          0        1         2
0  0.530240      NaN       NaN
1 -0.325325      NaN       NaN
2  0.636606      NaN  0.709533
3 -1.020924      NaN -1.777677
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

In [28]:
df.fillna(0) # replacing missing values with a constant

          0        1         2
0  0.530240  0.00000  0.000000
1 -0.325325  0.00000  0.000000
2  0.636606  0.00000  0.709533
3 -1.020924  0.00000 -1.777677
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

In [29]:
df.fillna({1: 0.5, 2: 0}) # with a dict you can use a fifferent fill value for each column

          0        1         2
0  0.530240  0.50000  0.000000
1 -0.325325  0.50000  0.000000
2  0.636606  0.50000  0.709533
3 -1.020924  0.50000 -1.777677
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

In [30]:
 _ = df.fillna(0, inplace=True)

In [31]:
df

          0        1         2
0  0.530240  0.00000  0.000000
1 -0.325325  0.00000  0.000000
2  0.636606  0.00000  0.709533
3 -1.020924  0.00000 -1.777677
4  0.204848  1.50772 -0.059858
5  1.460365 -0.41133  1.599131
6  0.695110 -0.51577 -0.097918

The same interpolation methods available for reindexing can be used with fillna

In [32]:
df = pd.DataFrame(np.random.randn(6, 3))

In [33]:
df.iloc[2:, 1] = NA

In [34]:
df.iloc[4:, 2] = NA

In [35]:
df

          0         1         2
0 -0.392180 -1.435537  0.841318
1  0.542726 -0.979924 -0.112948
2  0.323583       NaN  0.747805
3  1.799702       NaN -0.706585
4 -0.696739       NaN       NaN
5  0.377623       NaN       NaN

In [36]:
df.fillna(method='ffill') # replace NA's with the previous value

          0         1         2
0 -0.392180 -1.435537  0.841318
1  0.542726 -0.979924 -0.112948
2  0.323583 -0.979924  0.747805
3  1.799702 -0.979924 -0.706585
4 -0.696739 -0.979924 -0.706585
5  0.377623 -0.979924 -0.706585

In [37]:
df.fillna(method='ffill', limit=2) # replace NA's with the previous value up to 2 time

          0         1         2
0 -0.392180 -1.435537  0.841318
1  0.542726 -0.979924 -0.112948
2  0.323583 -0.979924  0.747805
3  1.799702 -0.979924 -0.706585
4 -0.696739       NaN -0.706585
5  0.377623       NaN -0.706585

Another example, pass the mean or median value of a Series

In [38]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [39]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [40]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 7.2 Data Transformation
Filtering, cleaning and other transformations are another class of important operations

#### Removing Duplicates

In [41]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [42]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated() # returns a boolean Series where duplicate (observed in previous row) or not

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data.drop_duplicates() # returns a DataFrame where the duplicated array is False

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)

In [46]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [47]:
data.drop_duplicates(['k1']) # note: keep the first observed value

    k1  k2  v1
0  one   1   0
1  two   1   1

In [48]:
data.drop_duplicates(['k1', 'k2'], keep='last') # keep the last observed value of duplicates

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

#### Transforming Data Using a Function or Mapping

Consider the following data about various kinds of meat

In [49]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [50]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

add a column indicating the type of animal - a mapping

In [51]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [52]:
lowercased = data['food'].str.lower()

In [53]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [54]:
data['animal'] = lowercased.map(meat_to_animal) # note, we don't have to change the case of the original data

In [55]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

Note: we could also have passed a function that does all the work

In [56]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

Using map is a convenient way to perform element-wise transformations

#### Replacing Values

In [57]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [58]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [59]:
data.replace(-999, np.nan) # you can include the parameter inplace to change the source data

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [60]:
data.replace([-999, -1000], np.nan) # passs a list to replace multiple values

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [61]:
data.replace([-999, -1000], [np.nan, 0]) # pass a list of substitutes for different replacements for each value

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [62]:
data.replace({-999: np.nan, -1000: 0}) # the arguement passed can also be a dict

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

#### Renaming Axis Indexes
Like values in a Series, axis lables can be similarly transformed by a function or mapping -> differently labeled objects

In [63]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [64]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [65]:
transform = lambda x: x[:4].upper()

In [66]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [67]:
data.index = data.index.map(transform) # You can assign to index, modifying the DataFrame in-place

In [68]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [69]:
data.rename(index=str.title, columns=str.upper) # create a transformed version without changing original

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [70]:
data.rename(index={'OHIO': 'iNDIANA'},    # rename and dict-like objects can be used to provide new values
           columns={'three': 'peekaboo'})

         one  two  peekaboo  four
iNDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [71]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [72]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### Discretization and Binning

In [73]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [74]:
bins = [18, 25, 35, 60, 100]

In [75]:
cats = pd.cut(ages, bins) # Special Categorical object

In [76]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

You can treat cats like an array of strings indicating the bin name

In [77]:
cats.codes # indicating which bin it belongs to

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [78]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [79]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

Parenthesis means the side is open while square bracket means the side is closed (inclusive). You can change which side is closed by passing right=False

In [80]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

You can also pass your own bin names

In [81]:
group_name = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [82]:
pd.cut(ages, bins, labels=group_name)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute equal-length bins

In [83]:
data = np.random.rand(20)

In [84]:
pd.cut(data, 4, precision=2) # the percision limits the number of decimal points

[(0.016, 0.26], (0.26, 0.5], (0.74, 0.98], (0.26, 0.5], (0.5, 0.74], ..., (0.26, 0.5], (0.74, 0.98], (0.5, 0.74], (0.26, 0.5], (0.26, 0.5]]
Length: 20
Categories (4, interval[float64]): [(0.016, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.98]]

qcut, bins the data based on sample quantiles which leads to roughly equal-size bins

In [85]:
data = np.random.randn(1000) # Normally distributed

In [86]:
cats = pd.qcut(data, 4) # Cut into quartiles

In [87]:
cats

[(-0.608, 0.0653], (0.662, 2.757], (-2.8089999999999997, -0.608], (0.0653, 0.662], (-2.8089999999999997, -0.608], ..., (0.662, 2.757], (-0.608, 0.0653], (-0.608, 0.0653], (0.662, 2.757], (0.662, 2.757]]
Length: 1000
Categories (4, interval[float64]): [(-2.8089999999999997, -0.608] < (-0.608, 0.0653] < (0.0653, 0.662] < (0.662, 2.757]]

In [88]:
pd.value_counts(cats)

(0.662, 2.757]                   250
(0.0653, 0.662]                  250
(-0.608, 0.0653]                 250
(-2.8089999999999997, -0.608]    250
dtype: int64

In [89]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.285, 0.0653], (0.0653, 1.275], (-1.285, 0.0653], (0.0653, 1.275], (-1.285, 0.0653], ..., (0.0653, 1.275], (-1.285, 0.0653], (-1.285, 0.0653], (0.0653, 1.275], (1.275, 2.757]]
Length: 1000
Categories (4, interval[float64]): [(-2.8089999999999997, -1.285] < (-1.285, 0.0653] < (0.0653, 1.275] < (1.275, 2.757]]

These (cut and qcut) discretization functions are especially useful for quantile and group analysis

#### Detecting and Filtering Outliers

Filtering or transformation outliers is largly a matter of applying array operations

In [90]:
data = pd.DataFrame(np.random.randn(1000, 4)) # Normally distributed data

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005235     0.036801     0.006440     0.044067
std       0.980407     0.987234     0.992612     1.003741
min      -2.738656    -2.844930    -3.155612    -3.571062
25%      -0.652073    -0.631096    -0.670209    -0.646289
50%       0.012007     0.050641    -0.008201     0.035982
75%       0.678800     0.700725     0.663864     0.726659
max       2.835779     3.622378     3.351530     3.966782

In [92]:
col = data[2]

In [93]:
col[np.abs(col) > 3] # data in col > abs 3

21    -3.155612
448    3.351530
541    3.295853
607   -3.008936
Name: 2, dtype: float64

In [94]:
data[(np.abs(data) > 3).any(1)] # data > abs 3 in and row

            0         1         2         3
21  -1.212613 -0.366451 -3.155612 -0.855720
43  -2.027051 -0.558999 -1.703766  3.125839
87   0.510367  1.355204  0.049244  3.966782
347 -0.630261 -0.971656 -0.798173  3.131929
448 -1.628503  0.511563  3.351530  0.457638
541 -1.460310 -0.219860  3.295853  0.366313
549 -1.296568 -0.051255  0.463117 -3.013628
607  0.076633  0.709040 -3.008936  0.904737
723  1.867442  3.157802 -0.342807  0.758144
731  0.542942 -0.897260  1.220945 -3.571062
768 -1.124061  3.622378  0.387563  0.198778
916 -0.514027 -0.543878  0.768834 -3.132956

In [95]:
data[np.abs(data) > 3] = np.sign(data) * 3 # code to cap values outside the interval -3 to 3

np.sign(data) product 1 and -1 values based on whether the values in data are positive or negative

In [96]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005235     0.036021     0.005957     0.043560
std       0.980407     0.984677     0.990037     0.997278
min      -2.738656    -2.844930    -3.000000    -3.000000
25%      -0.652073    -0.631096    -0.670209    -0.646289
50%       0.012007     0.050641    -0.008201     0.035982
75%       0.678800     0.700725     0.663864     0.726659
max       2.835779     3.000000     3.000000     3.000000

In [97]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0 -1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0  1.0

#### Permutations and Random Sampling

In [98]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

In [99]:
sampler = np.random.permutation(5) # produce an array of new ordering of the rows (index?)

In [100]:
sampler

array([0, 4, 3, 1, 2])

In [101]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [102]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [103]:
df.sample(n=3) # to select a random subset without replacement

    0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [104]:
choices = pd.Series([5, 7, -1, 6, 4])

In [105]:
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [106]:
draws = choices.sample(n=10, replace=True) # to select random with replacement

In [107]:
draws

4    4
2   -1
2   -1
2   -1
2   -1
0    5
4    4
0    5
1    7
0    5
dtype: int64

#### Computing Indicator/Dummy Variables
Converting a categorical variable into a "dummy" or "indicator" matrix

If a column in a DataFrame has k distince values, you would derice a matrix or DataFrame with k columns containing all 1s and 0s

In [108]:
df = pd.DataFrame({'key':['b', 'b', 'a', 'c', 'a', 'b'],
                  'data1': range(6)})

In [109]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [110]:
pd.get_dummies(df['key']) # create a matrix of 1s and 0s of values columns

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

Add a prefix to the columns

In [111]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [112]:
df_with_dummy = df[['data1']].join(dummies)

In [113]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

If a row in a DataFrame belongs to multiple categories, things are a bit more complicated

In [114]:
mnames = ['movie_id', 'title', 'genres']

In [115]:
movies = pd.read_table(datasets+'movielens/movies.dat', sep='::',
                      header=None, names=mnames)

c:\users\martinvm1\envs\py2\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

c:\users\martinvm1\envs\py2\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [116]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

Adding indicator variables for each genre requires a little bit of wrangling

In [117]:
all_genres = []

In [118]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [119]:
print(x)

Drama|Thriller

In [120]:
genres = pd.unique(all_genres)

In [121]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

Start indicator DataFrame as all zeros

In [122]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [123]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [124]:
gen = movies.genres[0] # genre field of the first row

In [125]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [126]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)